import React, { useState, useEffect } from "react"
import { Bar } from "react-chartjs-2";

// data
var votes = [
  {
    "Партия": "1- \"ВМРО - Българско национално движение\".",
    "Хартиено": 19,
    "Машинно": 16,
    "Общо": 35
  },
  {
    "Партия": "2 - \"Ние, гражданите",
    "Хартиено": 1,
    "Машинно": 1,
    "Общо": 2
  },
  {
    "Партия": "3 - \"Български национален съюз",
    "Хартиено": 0,
    "Машинно": 0,
    "Общо": 0
  },
  {
    "Партия": "4 - \"БСП за България",
    "Хартиено": 31,
    "Машинно": 17,
    "Общо": 48
  },
  {
    "Партия": "5 - \"Възраждане",
    "Хартиено": 8,
    "Машинно": 5,
    "Общо": 13
  },
  {
    "Партия": "6 - АБВ",
    "Хартиено": 1,
    "Машинно": 0,
    "Общо": 1
  },
  {
    "Партия": "7 - \"Атака",
    "Хартиено": 3,
    "Машинно": 0,
    "Общо": 3
  },
  {
    "Партия": "8 - КОД",
    "Хартиено": 0,
    "Машинно": 0,
    "Общо": 0
  },
  {
    "Партия": "9 - ДПС",
    "Хартиено": 3,
    "Машинно": 3,
    "Общо": 6
  },
  {
    "Партия": "10 - \"Българска прогресивна линия",
    "Хартиено": 0,
    "Машинно": 0,
    "Общо": 0
  },
  {
    "Партия": "11 - \"Демократична България",
    "Хартиено": 26,
    "Машинно": 26,
    "Общо": 52
  },
  {
    "Партия": "12 - \"Възраждане на отечеството",
    "Хартиено": 2,
    "Машинно": 2,
    "Общо": 4
  },
  {
    "Партия": "13 - \"Движение заедно за промяната",
    "Хартиено": 2,
    "Машинно": 0,
    "Общо": 2
  },
  {
    "Партия": "14 - \"Българско национално обединение",
    "Хартиено": 9,
    "Машинно": 9,
    "Общо": 18
  },
  {
    "Партия": "15 - \"Нация",
    "Хартиено": 0,
    "Машинно": 0,
    "Общо": 0
  },
  {
    "Партия": "16 - ПП МИР",
    "Хартиено": 2,
    "Машинно": 0,
    "Общо": 2
  },
  {
    "Партия": "17 - Коалиция \"Граждани от протеста",
    "Хартиено": 0,
    "Машинно": 0,
    "Общо": 0
  },
  {
    "Партия": "18 - \"Изправи се! Мутри вън!",
    "Хартиено": 11,
    "Машинно": 9,
    "Общо": 20
  },
  {
    "Партия": "19 - \"Глас народен",
    "Хартиено": 1,
    "Машинно": 0,
    "Общо": 1
  },
  {
    "Партия": "20 - \"Движение на непартийните кандидати",
    "Хартиено": 1,
    "Машинно": 0,
    "Общо": 1
  },
  {
    "Партия": "21 - \"Републиканци за България",
    "Хартиено": 0,
    "Машинно": 1,
    "Общо": 1
  },
  {
    "Партия": "22 - \"Правото",
    "Хартиено": 0,
    "Машинно": 0,
    "Общо": 0
  },
  {
    "Партия": "23 - \"Благоденствие, обединение, градивност",
    "Хартиено": 0,
    "Машинно": 0,
    "Общо": 0
  },
  {
    "Партия": "24 - \"Патриотична коалиция - Воля и НФСБ",
    "Хартиено": 4,
    "Машинно": 1,
    "Общо": 5
  },
  {
    "Партия": "25 - \"Партия на ЗЕЛЕНИТЕ",
    "Хартиено": 2,
    "Машинно": 1,
    "Общо": 3
  },
  {
    "Партия": "26 - \"Общество за нова България",
    "Хартиено": 0,
    "Машинно": 0,
    "Общо": 0
  },
  {
    "Партия": "27 -  \"Български съюз за директна демокрация",
    "Хартиено": 0,
    "Машинно": 0,
    "Общо": 0
  },
  {
    "Партия": "28 - Коалиция \"ГЕРБ - СДС",
    "Хартиено": 74,
    "Машинно": 21,
    "Общо": 95
  },
  {
    "Партия": "29 - \"Има такъв народ",
    "Хартиено": 50,
    "Машинно": 46,
    "Общо": 96
  },
  {
    "Партия": "30 - \"Пряка демокрация",
    "Хартиено": 0,
    "Машинно": 0,
    "Общо": 0
  }
].sort((a, b) => b.Общо - a.Общо);


const IndexPage = () => {
    const [whatever, setWhatever] = useState({});

    const chart = () => {
        setWhatever({
            labels: votes.map(vote => vote.Партия),
            datasets: [
              {
                label: "Хартиено",
                data: votes.map(vote => vote.Хартиено),
                backgroundColor: 'rgb(255, 99, 132)'
              },
              {
                label: "Машинно",
                data: votes.map(vote => vote.Машинно),
                backgroundColor: 'rgb(54, 162, 235)'
              },
              {
                label: "Общо",
                data: votes.map(vote => vote.Общо),
                backgroundColor: 'rgb(75, 192, 192)'
              }
            ]
        })
    }

    useEffect(() => {
        chart()
    }, [])

    return(
        <div>
            <div>
                <Bar data={whatever}/>
            </div>
        </div>
    )
}

export default IndexPage


